[
    {
      "date": "October 9 2023",
      "game": {
        "name": "Let's play Persona 5 Royal!",
        "gameVideo": "https://www.youtube.com/embed/gJIl44rbcJE?si=J_hLjItslIlgdlGB",
        "type": "JRPG",
        "creator": "Atlus",
        "steamDescription": "Don the mask and join the Phantom Thieves of Hearts as they stage grand heists, infiltrate the minds of the corrupt, and make them change their ways!",
        "timeSpent": "3 hours",
        "whatIDid": "I spent three days (in-game) doing my daily activities and also had a free-time event with Ryuji. Then, I visited Kamoshida's palace, battled random enemies, and spent some time doing puzzles.",
        "myComments": "Maloney:  I had so much fun playing this game! I'm still getting used to the gameplay, so I sometimes had to look at a guide to help me. The game's graphics and soundtrack are amazing! I'm looking forward to meet Yusuke as he is my favorite character of the game!"
      }
    },
    {
      "date": "October 10 2023",
      "game": {
        "name": "Let's play Undertale!",
        "gameVideo": "https://www.youtube.com/embed/Y-sEcbtRhzg?si=G5CjRUSfLmXngL4z",
        "type": "Indie, RPG",
        "creator": "Toby Fox",
        "steamDescription": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.",
        "timeSpent": "2 hours",
        "whatIDid": "I finished exploring the Waterfall area, fought Undyne and then became her friend. Then I spent some time grinding some gold at the Temmie's village.",
        "myComments": "Maloney:  I died multiple times fighting Undyne, but strangely enough, it was less hard than the previous boss fight. That friendship event was hilarious, gosh no wonder Papyrus sucks at cooking! "
      }
    },
    {
      "date": "October 11 2023",
      "game": {
        "name": "Let's play Danganronpa V3!",
        "gameVideo": "https://www.youtube.com/embed/XHpjoawu6yc?si=GI9lzVU4yNWb3drt",
        "type": "Visual Novel, Murder Mystery",
        "creator": "Spike Chunsoft",
        "steamDescription": "A new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished.",
        "timeSpent": "1.5 hours",
        "whatIDid": "Since I already finished the main game, I spent some time on the bonus modes, specifically the Talent Plan and Monokuma's test.",
        "myComments": "Maloney:  Gosh, playing DRV3's Talent Plan is a pain in the ass because luck plays a huge part in it. I had to restart a few times before developping a decent new S-Card."
      }
    },
    {
      "date": "October 12 2023",
      "game": {
        "name": "Let's play Our Life!",
        "gameVideo": "https://www.youtube.com/embed/s9MsxsS_3uA?si=UYf9SewLTdzwuKXL",
        "type": "Dating Sim, Visual Novel",
        "creator": "GB Patch",
        "steamDescription": "A twenty-dollar bill, four summers, fifteen years, and a one of a kind life. Create an experience that’s all your own in this near-fully customizable visual novel where you grow from childhood to adulthood with the lonely boy next door.",
        "timeSpent": "2.5 hours",
        "whatIDid": "I played a few scenes during the early-teenage time period. I also played the Derek episodes.",
        "myComments": "Maloney:  Can you believe that is like, my eight replay of the game??? This time I am trying to play Derek's romance route. He's a really cute and wholesome guy although I definitely prefer Cove."
      }
    }
  ]
  